openfoam2206/tutorials/multiphase/interFoam/RAS/waterChannel/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom   mesh;
sourceCase      "<case>";
sourcePatches   (outlet);

flipNormals     false;

extrudeModel    linearDirection;

nLayers             40;
expansionRatio      1.0;

linearDirectionCoeffs
{
    direction       (1 -0.2 -0.03);
    thickness       40;
}

mergeFaces      false;


// ************************************************************************* //
